Revit 2018 API
FabricationConfiguration.ReloadConfiguration Method
 Reloads the fabrication configuration from its source fabrication configuration.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2016
Syntax
C#
public ConfigurationReloadInfo ReloadConfiguration()
Visual Basic
Public Function ReloadConfiguration As ConfigurationReloadInfo
Visual C++
public:
ConfigurationReloadInfo^ ReloadConfiguration()
Return Value
 The information about the reload of the fabrication configuration.
Remarks
 The configuration must be reloaded from its source fabrication configuration before loading new fabrication services.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  The fabrication configuration is not set yet. -or- this operation failed.
See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace